-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Дек 29 2024 г., 02:59
-- Версия сервера: 10.4.32-MariaDB
-- Версия PHP: 8.0.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `chat-bot`
--

-- --------------------------------------------------------

--
-- Структура таблицы `admins`
--

CREATE TABLE `admins` (
  `id` int(5) NOT NULL,
  `login` varchar(50) NOT NULL,
  `email` varchar(50) NOT NULL,
  `password` varchar(70) NOT NULL,
  `faculty` varchar(50) NOT NULL,
  `course` varchar(50) NOT NULL,
  `role` varchar(20) NOT NULL,
  `full_name` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Дамп данных таблицы `admins`
--

INSERT INTO `admins` (`id`, `login`, `email`, `password`, `faculty`, `course`, `role`, `full_name`) VALUES
(1, 'satdarko', 'dashakarmak@gmail.com', '$2y$10$oxdNsBCFIt6XJxJDxgqOreo78KNsVRK14thEYgKVsd.ayoFpuVCWq', 'Факультет математики', 'Комп\'ютерні мережі', 'admin', 'Сатко Дар\'я Олегівна'),
(2, 'dashakarmak', 'dashakarmak@gmail.com', '$2y$10$XZYv8jlrZzyH/uiaShwVLO3I1Cp03cfmh1KIbKWpXhVL3BG5.kFoi', 'ааа', '', 'admin', ''),
(3, 'drinasatko', 'dashakarmak2@gmail.com', '$2y$10$vboYCBOTVd6HpbIvHJlpT.iEj21d4P0t.sT.8bZgGDIeQF5wfsdfS', 'ааа', '', 'admin', '');

-- --------------------------------------------------------

--
-- Структура таблицы `courses`
--

CREATE TABLE `courses` (
  `id` int(5) NOT NULL,
  `id_user` int(10) NOT NULL,
  `id_admin` int(10) NOT NULL,
  `course1` varchar(50) NOT NULL,
  `course2` varchar(50) NOT NULL,
  `course3` varchar(50) NOT NULL,
  `course4` varchar(50) NOT NULL,
  `course5` varchar(50) NOT NULL,
  `course6` varchar(50) NOT NULL,
  `course7` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Дамп данных таблицы `courses`
--

INSERT INTO `courses` (`id`, `id_user`, `id_admin`, `course1`, `course2`, `course3`, `course4`, `course5`, `course6`, `course7`) VALUES
(1, 1, 0, 'Веб-розробка', 'Алгоритми', 'Операційні системи', 'Алгоритми', 'Веб-розробка', 'Операційні системи', 'Машинне навчання'),
(2, 1, 0, 'Веб-розробка', 'Алгоритми', 'Операційні системи', 'Алгоритми', 'Веб-розробка', 'Операційні системи', 'Машинне навчання'),
(3, 1, 0, 'Веб-розробка', 'Алгоритми', 'Операційні системи', 'Алгоритми', 'Веб-розробка', 'Операційні системи', 'Машинне навчання'),
(4, 0, 1, '', 'Веб-розробка', '', '', '', '', ''),
(5, 0, 1, '', 'Веб-розробка', '', '', '', '', ''),
(6, 0, 1, 'Веб-розробка', 'Веб-розробка', '', '', '', '', ''),
(7, 0, 1, 'Веб-розробка', 'Веб-розробка', '', '', '', '', ''),
(8, 0, 1, 'Веб-розробка', 'Веб-розробка', '', '', '', '', ''),
(9, 0, 1, 'Веб-розробка', 'Веб-розробка', '', '', '', '', ''),
(10, 1, 0, '', 'Веб-розробка', '', '', '', 'Машинне навчання', ''),
(11, 1, 0, 'Веб-розробка', 'Алгоритми', 'Операційні системи', 'Алгоритми', 'Веб-розробка', 'Операційні системи', ''),
(12, 1, 0, 'Веб-розробка', '', '', 'Алгоритми', 'Веб-розробка', 'Операційні системи', 'Машинне навчання'),
(13, 1, 0, '', '', 'Веб-розробка', '', 'Веб-розробка', 'Операційні системи', 'Машинне навчання'),
(14, 1, 0, 'Веб-розробка', 'Веб-розробка', '', '', '', '', ''),
(15, 1, 0, 'Алгоритми', 'Веб-розробка', '', '', '', '', ''),
(16, 0, 1, 'Веб-розробка', 'Веб-розробка', '', '', '', '', ''),
(17, 0, 1, 'Веб-розробка', 'Веб-розробка', '', '', '', '', ''),
(18, 0, 1, 'Комп\'ютерні мережі', 'Веб-розробка', '', '', '', '', ''),
(19, 0, 1, 'Веб-розробка', 'Веб-розробка', '', '', '', '', ''),
(20, 0, 1, 'Алгоритми', 'Веб-розробка', '', '', '', '', ''),
(21, 0, 1, 'Комп\'ютерні мережі', 'Веб-розробка', '', 'Комп\'ютерні мережі', '', '', ''),
(22, 0, 1, '', 'Операційні системи', '', '', '', '', ''),
(23, 0, 1, 'Бази даних', 'Веб-розробка', '', '', '', '', ''),
(24, 0, 1, 'Веб-розробка', 'Веб-розробка', 'Комп\'ютерні мережі', '', '', '', ''),
(25, 0, 1, '', 'Веб-розробка', '', '', '', '', 'Кібербезпека'),
(26, 1, 0, 'Веб-розробка', 'Алгоритми', 'Операційні системи', '', 'Веб-розробка', 'Операційні системи', 'Машинне навчання'),
(27, 0, 1, 'Веб-розробка', 'Веб-розробка', '', '', '', '', ''),
(28, 0, 1, 'Операційні системи', 'Веб-розробка', '', '', '', '', '');

-- --------------------------------------------------------

--
-- Структура таблицы `memory`
--

CREATE TABLE `memory` (
  `id` int(10) NOT NULL,
  `id_admin` int(5) NOT NULL,
  `topic` varchar(200) NOT NULL,
  `text` varchar(1500) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Дамп данных таблицы `memory`
--

INSERT INTO `memory` (`id`, `id_admin`, `topic`, `text`) VALUES
(2, 1, 'Трансляцiя та виконання програм', 'ировіорвіорвсоривіо івимівсоривіисрівилсл осрмоиусСтаття — науковий або публіцистичний твір невеликого розміру в збірці, журналі, газеті тощо[1]. Вона є результатом розумового процесу, в якому поєдную\nСтаття — науковий або публіцистичний твір невеликого розміру в збірці, журналі, газеті тощо[1]. Вона є результатом розумового процесу, в якому поєднуються аналіз, структурування, формулювання та висловлення думок.\n\n\nСтаття (журналістика)\nНаукова стаття\nЕнциклопедична стаття\nСтаття Вікіпедії\n\n\nСловникова стаття — стаття, що описує слово, словосполучення, їх значення, приклади вживання у словнику.\nЕлектронна стаття — стаття на електронному носії інформації або розповсюджена електронними засобами масової інформації (також мережева стаття, стаття в інтернеті, стаття у мережі).\n\nСтаття — самостійний розділ, параграф у юридичному документі, описі, словнику і т.ін.[1]\nСтаття — розділ у документі, бюджеті, який містить назву джерела доходу або обґрунтування витрати[1].\nСтаття — розряд, вид, галузь будь-чого.[1]\nСтаття — розряд, ступінь старшинського (до революції також матроського) військового звання у флоті.[1]\nЕтимологія'),
(3, 1, 'Трансляцiя та виконання програм', 'лрівсоривіавіСтаття — науковий або публіцистичний твір невеликого розміру в збірці, журналі, газеті тощо[1]. Вона є результатом розумового процесу, в якому поєднуються аналіз, структурування, формулювання та висловлення думок.\r\nСтаття (журналістика)\r\nНаукова стаття\r\nЕнциклопедична стаття\r\nСтаття Вікіпедії\r\nСловникова стаття — стаття, що описує слово, словосполучення, їх значення, приклади вживання у словнику.\r\nЕлектронна стаття — стаття на електронному носії інформації або розповсюджена електронними засобами масової інформації (також мережева стаття, стаття в інтернеті, стаття у мережі).\r\nСтаття — самостійний розділ, параграф у юридичному документі, описі, словнику і т.ін.[1]\r\nСтаття — розділ у документі, бюджеті, який містить назву джерела доходу або обґрунтування витрати[1].\r\nСтаття — розряд, вид, галузь будь-чого.[1]\r\nСтаття — розряд, ступінь старшинського (до революції також матроського) військового звання у флоті.[1]\r\nЕтимологія'),
(6, 1, 'апмап', 'пмав'),
(7, 1, 'Як ефективно організувати час для навчання: Поради', 'Шановні студенти!\r\n\r\nЗ наближенням сесії важливо знайти правильний баланс між навчанням і відпочинком. Ось кілька порад для організації вашого часу:\r\n\r\nСкладіть розклад: Планування є ключем до успіху. Запишіть усі завдання, терміни і важливі події.\r\nРозділіть великі завдання на менші: Якщо вам потрібно вивчити багато матеріалу, розбийте його на частини і вивчайте поетапно.\r\nВідпочинок важливий: Не забувайте про відпочинок, адже надмірне навантаження може призвести до вигорання.\r\nСтавте конкретні цілі: Наприклад, \"Вивчу перші три глави за два години\". Це дасть вам мотивацію та допоможе сконцентруватися.\r\nБажаю успіхів у навчанні та гарного відпочинку!'),
(8, 3, 'Секрети успішної підготовки до лабораторних та практичних занять', 'Шановні студенти!\r\n\r\nЛабораторні та практичні заняття — важлива частина навчання. Щоб досягти успіху, дотримуйтесь кількох простих порад:\r\n\r\nПопередня підготовка: Перед кожним заняттям обов\'язково ознайомтесь з теоретичними матеріалами, які стосуються теми лабораторної роботи.\r\nЗапитання: Якщо щось незрозуміло під час роботи, не соромтесь звертатися до викладача або асистента. Питання не бувають «тупими»!\r\nПрактичні навички: Чим більше ви практикуєте, тим впевненішими будете в застосуванні теорії. Тому не бійтеся експериментувати.\r\nЗапис результатів: Завжди занотовуйте ваші спостереження та результати під час виконання завдання, це важливо для підготовки звіту.\r\nБудьте уважні та відповідальні, і ваші зусилля обов\'язково принесуть результат!'),
(9, 3, 'Чому важливо брати участь у наукових проектах?', 'Шановні студенти!\r\n\r\nБагато студентів задаються питанням, чи варто брати участь у наукових проектах під час навчання. Ось кілька причин, чому це варто робити:\r\n\r\nПрактичний досвід: Наукові проекти дозволяють застосувати теоретичні знання на практиці та отримати цінний досвід.\r\nРозвиток навичок: Ви навчитеся працювати в команді, розвиватимете навички презентації та ведення досліджень.\r\nМожливості для кар\'єри: Участь у наукових проектах може стати потужним плюсом у вашому резюме та допомогти знайти цікаву роботу після закінчення університету.\r\nЗадоволення від роботи: Наукова діяльність допомагає знайти нові інтереси і можливості для розвитку у вашій галузі.\r\nНе бійтеся шукати нові виклики і долучатися до наукових досліджень!');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(5) UNSIGNED NOT NULL,
  `full_name` varchar(50) NOT NULL,
  `login` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `email` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `password` varchar(70) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `u_group` varchar(10) NOT NULL,
  `faculty` varchar(50) NOT NULL,
  `role` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `full_name`, `login`, `email`, `password`, `u_group`, `faculty`, `role`) VALUES
(1, 'Сатко Дар\'я Олегівна', 'satdarko', 'darinasatko@gmail.com', '$2y$10$c1DgOmDl46eX7.6cLyiTLe8RR4a0u14QZ2Yotb5OfIS8OwHdKkhH2', 'ТВ-21', 'Факультет ІТ', ''),
(2, '', 'satdarko1', 'das1hakarmak@gmail.com', '$2y$10$9vXFfqpnjG7/axXraRxfhu0sjthM2P3wqfzRdiWnAKK6OZXJ1jjZW', 'ТВ-21', '', 'student'),
(4, '', 'satdarko', 'dashakarmak@gmail.com', '$2y$10$A/Xspct5tJXjbvhQYcCmZ.Pp5lLu5V2AJO5kGx7f1ar9Yj.Hk3q.K', '123', '', 'student'),
(5, '', 'satdarko', 'dashakarmak@gmail.com', '$2y$10$dpGX2WcW19feOcA8yyR.2uWiVLXoD1Iic6V.Cn1ikoGSF3yOXLmS6', 'ТВ-21', '', 'student'),
(6, '', 'satdarko', 'dashakarmak@gmail.com', '$2y$10$Mgsb3uzQla3FbWzDo2HJp.1.Fj3po8l6KhXLGC.yg65evUcwkXEvG', '123', '', 'student');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `admins`
--
ALTER TABLE `admins`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `courses`
--
ALTER TABLE `courses`
  ADD PRIMARY KEY (`id`),
  ADD KEY `id_user` (`id_user`),
  ADD KEY `id_user_2` (`id_user`),
  ADD KEY `id_user_3` (`id_user`),
  ADD KEY `id_admin` (`id_admin`);

--
-- Индексы таблицы `memory`
--
ALTER TABLE `memory`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fk_id_admin` (`id_admin`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `admins`
--
ALTER TABLE `admins`
  MODIFY `id` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `courses`
--
ALTER TABLE `courses`
  MODIFY `id` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=29;

--
-- AUTO_INCREMENT для таблицы `memory`
--
ALTER TABLE `memory`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(5) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `memory`
--
ALTER TABLE `memory`
  ADD CONSTRAINT `fk_id_admin` FOREIGN KEY (`id_admin`) REFERENCES `admins` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
